/****************************************Copyright (c)**************************************************
**                                    广州致远电子有限公司
**                                     工业通信网络事业部
**                                http://www.embedcontrol.com
**-------------------------------------文件信息--------------------------------------------------------
**	文   件  	名:	LPC2400CAN.h
** 	当  前  版  本:	v1.0
** 	日		    期:	2007年5月06日
**	描		    述:	
**-------------------------------------历史创建--------------------------------------------------------
**	文   件  	名:	LPC2400CAN.h
** 	版  		本:	v1.0
** 	日		    期:	2008年4月26日
**	创    建    人:	刘彦龙
**	描		    述:	LPC2400开发板实验教程实例代码
**-------------------------------------历史修改--------------------------------------------------------
**	文   件  	名:	
** 	版  		本:	
** 	日		    期:	
**	修   改     人:	
**	描		    述:	
*********************************************************************************************************/
#ifndef _UART3_H_
#define _UART3_H_
/*********************************************************************************************************
 *               头文件包含                                             
*********************************************************************************************************/
#include "config.h"

extern uint8 T3_Rec_Buffer[],T3_Send_Length, T3_sendCount,T3_sendIndex,T3_haveRecData,T3_recCount,T3_PermitRecFlag;
extern uint8 T3_haveRecDone,T3_ItsRecTime;
extern uint16 T3_receive_time;


extern void T3_check(void);
extern void T3_recCheck();
extern void  UART3_Ini(void);
extern void LoadT3_sendBuff(uint8 sendNum);
extern void GetUart3KeyInfo(uint8 *pBuff);


#endif