/****************************************Copyright (c)**************************************************
**                                    广州致远电子有限公司
**                                     工业通信网络事业部
**                                http://www.embedcontrol.com
**-------------------------------------文件信息--------------------------------------------------------
**	文   件  	名:	LPC2400CAN.h
** 	当  前  版  本:	v1.0
** 	日		    期:	2007年5月06日
**	描		    述:	
**-------------------------------------历史创建--------------------------------------------------------
**	文   件  	名:	LPC2400CAN.h
** 	版  		本:	v1.0
** 	日		    期:	2008年4月26日
**	创    建    人:	刘彦龙
**	描		    述:	LPC2400开发板实验教程实例代码
**-------------------------------------历史修改--------------------------------------------------------
**	文   件  	名:	
** 	版  		本:	
** 	日		    期:	
**	修   改     人:	
**	描		    述:	
*********************************************************************************************************/
#ifndef _UART2_H_
#define _UART2_H_
/*********************************************************************************************************
 *               头文件包含                                             
*********************************************************************************************************/
#include "config.h"
extern uint8 T2_Rec_Buffer[],T2_Send_Length, T2_sendCount,T2_sendIndex,T2_haveRecData,T2_recCount,T2_PermitRecFlag;
extern uint8 T2_haveRecDone,T2_ItsRecTime;
extern uint8 T2_StepSend,switchToAFCdataBuff[],uart2NormalFlag;
extern uint16 T2_receive_time,switchToAFC_heartBeat;
extern void T2_check(void);
extern void T2_recCheck();
extern void  UART2_Ini(void);
extern void Load_switchToAFCdataBuff();


#endif